informe.tex
% Created 2022-04-13 Wed 02:18
% Intended LaTeX compiler: pdflatex
\documentclass[letter]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{multicol}
\usepackage[margin=1.3in]{geometry}
\setlength{\columnsep}{1cm}
\usepackage{palatino}
\fontfamily{ppl}\selectfont
\usepackage[spanish, es-noindentfirst]{babel}
\usepackage{setspace}
\setstretch{1.5}
\usepackage{fancyhdr}
\fancyhf{}
\pagestyle{fancy}
\lhead{\hleft}
\rhead{\hright}
\cfoot{\thepage}
\renewcommand{\headrulewidth}{1pt}
\renewcommand{\footrulewidth}{0pt}
\newcommand{\hleft}{Informe 1er parcial}
\newcommand{\hright}{Jesus Rodolfo Izurieta Veliz}
\setlength{\parindent}{0em}
\author{Jesus Rodolfo Izurieta Veliz}
\date{\today}
\title{Primer parcial INF 354}
\hypersetup{
 pdfauthor={Jesus Rodolfo Izurieta Veliz},
 pdftitle={Primer parcial INF 354},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle


\section{Enunciados}
\label{sec:org2a863ef}

\begin{enumerate}
\item Seleccione un dataset del area medica o de abogacia (datos tabulares). Realice lo siguiente:

\begin{enumerate}
\item El calculo del 1er cuartil de datos, el percentil 50 por columna; explique qué significa en cada caso mediante Python sin uso de librerías

\item Realice lo mismo del inciso (a) con el uso de numpy y pandas

\item Grafique los datos y explique su comportamiento (PYTHON)
\end{enumerate}

\item Del dataset anterior realice en WEKA, tres algoritmos de preprocesamiento.

\item Del dataset anterior realice en PYTHON, tres algoritmos de preprocesamiento.

\item Con el uso de librerías en PYTHON, construya la dependencia de Abuelos, tios, padres, primos e hijos de su familia.

\item En PYTHON grafique el arbol de decision del dataset seleccionado.
\end{enumerate}

Cada pregunta debe ser almacenada en Github, la misma permitir su acceso minimamente a msilva@fcpn.edu.bo. Adjuntar el link por pregunta en un PDF o Word y enviarlo para su revisión.

\section{Solución}
\label{sec:org433c106}
Parcial resuelto: \url{https://github.com/izurietajr/Parcial-1-INF-354}
\end{document}
